AllogeneSSRD/STM32-Game-Engine/Menu_Template/game_1/Game_1.c
#include "Game_1.h"
#include "InputHandler.h"
#include "Menu.h"
#include "SubMenu_1.h"
#include "Joystick.h"
#include "LCD.h"
#include "PWM.h"
#include "Buzzer.h"
#include "stm32l4xx_hal.h"
#include <stdio.h>
#include <stdbool.h>
#include "rng.h"
#include "tim.h"
#include "main.h"


extern ST7789V2_cfg_t cfg0;
extern PWM_cfg_t pwm_cfg;      // LED PWM control
extern Buzzer_cfg_t buzzer_cfg; // Buzzer control
extern Joystick_cfg_t joystick_cfg; //Joystick control
extern volatile uint32_t g_tim6_ticks;
extern InputState current_input;

/**
 * @brief Game 1 Implementation - Student can modify
 * 
 * EXAMPLE: Shows how to use PWM LED for visual feedback
 * This is a placeholder with a bouncing animation that changes LED brightness.
 * Replace this with your actual game logic!
 */


// Frame rate for this game (in milliseconds)
#define GAME1_FRAME_TIME_MS 30  // ~33 FPS

// ===== Const Definitions =====
// LCD display dimensions
#define LCD_WIDTH 240
#define LCD_HEIGHT 240
#define PLAY_AREA_Y0 25  // Leave space at top for title
#define HUD_OFFSET_X 5
#define HUD_OFFSET_Y 5

// Player parameters 
#define PLAYER_RADIUS 6
#define PLAYER_COLOR 2
#define PLAYER_HP 10
// Player Movement parameters
#define MOVE_SPEED 2      // Pixels to move per update
#define MOVE_DELAY_MS 30  // Milliseconds between movement updates

// Enemy parameters
#define TARGET_RADIUS 4
#define TARGET_COLOR 6
#define TARGET_COUNT 8
#define TARGET_FALL_SPEED 1
#define TARGET_MOVE_DELAY_MS 66

#define TARGET_ADVANCED_RADIUS 6
#define TARGET_ADVANCED_COLOR 5
#define TARGET_ADVANCED_HP 3

#define TARGET_BOSS_RADIUS 9
#define TARGET_BOSS_COLOR 1
#define TARGET_BOSS_HP 8

#define TARGET_ITEM_WIDTH 10
#define TARGET_ITEM_HEIGHT 10
#define TARGET_ITEM_FALL_SPEED 1
#define TARGET_ITEM_HEAL_COLOR 7
#define TARGET_ITEM_SPREAD_COLOR 14
#define TARGET_ITEM_HEAL_HP 1
#define TARGET_ITEM_SPREAD_HP 1

#define TARGET_SCORE_NORMAL 1
#define TARGET_SCORE_ADVANCED 5
#define TARGET_SCORE_BOSS 20

// Bullet parameters
#define BULLET_RADIUS 2
#define BULLET_SPEED 3
#define BULLET_FIRE_INTERVAL_MS 300
#define MAX_BULLETS 32

#define SPREAD_POWERUP_DURATION_MS 7000
#define SPREAD_BULLET_COUNT 5
#define SPREAD_BULLET_OFFSET 10

#define MAX_ENEMY_BULLETS 8
#define ENEMY_BULLET_RADIUS 2
#define ENEMY_BULLET_SPEED 2
#define ENEMY_BULLET_COLOR 7

#define EASY_WIN_SCORE 100
#define HARD_WIN_SCORE 200

#define BTN3_HOLD_MS 1500


// static const char* mode_options[] = {
//     "Easy", // 模式内部显示
//     "Hard",
//     "Infinite"
// };

// ===== Game Function Prototypes =====
typedef struct {
    const char* mode_name;
    uint8_t target_fall_speed;
    uint16_t target_move_delay_ms;
    uint16_t bullet_fire_interval_ms;
    uint16_t boss_fire_interval_ms;
    uint8_t advanced_spawn_chance;
    uint8_t boss_spawn_chance;
    uint8_t heal_spawn_chance;
    uint8_t spread_spawn_chance;
    uint16_t win_score; // 0 means endless mode
} GameDifficulty;

typedef enum {
    TARGET_TYPE_NORMAL = 0,
    TARGET_TYPE_ADVANCED,
    TARGET_TYPE_BOSS,
    TARGET_TYPE_ITEM_HEAL,
    TARGET_TYPE_ITEM_SPREAD
} TargetType;

uint8_t Circles_Overlap(uint16_t x1, uint16_t y1, uint16_t r1,
                        uint16_t x2, uint16_t y2, uint16_t r2);

void Place_Target(uint8_t index,
                  uint16_t *target_x,
                  uint16_t *target_y,
                  TargetType *target_type,
                  int16_t *target_hp,
                  uint32_t *target_last_fire_tick,
                  uint16_t player_x,
                  uint16_t player_y,
                  const GameDifficulty *difficulty);

static GameDifficulty Get_Difficulty_From_Mode(SubMenuState selected_mode);
static TargetType Pick_Target_Type(const GameDifficulty *difficulty);
static uint8_t Get_Target_Radius(TargetType type);
static uint8_t Get_Target_Color(TargetType type);
static int16_t Get_Target_Initial_HP(TargetType type);
static uint16_t Get_Target_Kill_Score(TargetType type);
static uint8_t Is_Target_Item(TargetType type);
static int32_t Max(int32_t a, int32_t b);
static int32_t Clamp(int32_t value, int32_t min_value, int32_t max_value);
static uint8_t Circle_Rect_Overlap(uint16_t circle_x, uint16_t circle_y, uint16_t circle_r,
                                   uint16_t rect_center_x, uint16_t rect_center_y,
                                   uint16_t rect_w, uint16_t rect_h);
static void Draw_Target_Entity(uint16_t x, uint16_t y, TargetType type, uint8_t color);

// ===== Game Function Implementations =====

static uint16_t Random_U16(uint16_t max)
{
  uint32_t rnd = 0;
  HAL_RNG_GenerateRandomNumber(&hrng, &rnd);
  return (uint16_t)(rnd % max);
}

static GameDifficulty Get_Difficulty_From_Mode(SubMenuState selected_mode)
{
    GameDifficulty cfg;

    if (selected_mode == SUBMENU_1_STATE_2)
    {
        // Hard: faster enemies and slightly slower player shooting
        cfg.mode_name = "Hard";
        cfg.target_fall_speed = 2;
        cfg.target_move_delay_ms = TARGET_MOVE_DELAY_MS;
        cfg.bullet_fire_interval_ms = BULLET_FIRE_INTERVAL_MS;
        cfg.boss_fire_interval_ms = 700;
        cfg.advanced_spawn_chance = 35;
        cfg.boss_spawn_chance = 12;
        cfg.heal_spawn_chance = 5;
        cfg.spread_spawn_chance = 8;
        cfg.win_score = HARD_WIN_SCORE;
    }
    else if (selected_mode == SUBMENU_1_STATE_3)
    {
        cfg.mode_name = "Infinite";
        cfg.target_fall_speed = TARGET_FALL_SPEED;
        cfg.target_move_delay_ms = TARGET_MOVE_DELAY_MS;
        cfg.bullet_fire_interval_ms = BULLET_FIRE_INTERVAL_MS;
        cfg.boss_fire_interval_ms = 1000;
        cfg.advanced_spawn_chance = 30;
        cfg.boss_spawn_chance = 10;
        cfg.heal_spawn_chance = 5;
        cfg.spread_spawn_chance = 5;
        cfg.win_score = 0;
    }
    else
    {
        cfg.mode_name = "Easy";
        cfg.target_fall_speed = TARGET_FALL_SPEED;
        cfg.target_move_delay_ms = TARGET_MOVE_DELAY_MS;
        cfg.bullet_fire_interval_ms = BULLET_FIRE_INTERVAL_MS;
        cfg.boss_fire_interval_ms = 1200;
        cfg.advanced_spawn_chance = 20;
        cfg.boss_spawn_chance = 5;
        cfg.heal_spawn_chance = 10;
        cfg.spread_spawn_chance = 10;
        cfg.win_score = EASY_WIN_SCORE;
    }

