AllogeneSSRD/STM32-Game-Engine/Menu_Template/game_1/Game_1.c
    return cfg;
}

static TargetType Pick_Target_Type(const GameDifficulty *difficulty)
{
    uint16_t r = Random_U16(100);
    if (r < difficulty->boss_spawn_chance)
        return TARGET_TYPE_BOSS;
    r -= difficulty->boss_spawn_chance;

    if (r < difficulty->advanced_spawn_chance)
        return TARGET_TYPE_ADVANCED;
    r -= difficulty->advanced_spawn_chance;

    if (r < difficulty->heal_spawn_chance)
        return TARGET_TYPE_ITEM_HEAL;
    r -= difficulty->heal_spawn_chance;

    if (r < difficulty->spread_spawn_chance)
        return TARGET_TYPE_ITEM_SPREAD;

    return TARGET_TYPE_NORMAL;
}

static uint8_t Get_Target_Radius(TargetType type)
{
    if (type == TARGET_TYPE_ADVANCED)       return TARGET_ADVANCED_RADIUS;
    if (type == TARGET_TYPE_BOSS)           return TARGET_BOSS_RADIUS;
    if (type == TARGET_TYPE_ITEM_HEAL || type == TARGET_TYPE_ITEM_SPREAD)
        return Max(TARGET_ITEM_WIDTH, TARGET_ITEM_HEIGHT) / 2; // Treat items as circles for collision
    else                                    return TARGET_RADIUS;
}

static uint8_t Get_Target_Color(TargetType type)
{
    if (type == TARGET_TYPE_ADVANCED)       return TARGET_ADVANCED_COLOR;
    if (type == TARGET_TYPE_BOSS)           return TARGET_BOSS_COLOR;
    if (type == TARGET_TYPE_ITEM_HEAL)      return TARGET_ITEM_HEAL_COLOR;
    if (type == TARGET_TYPE_ITEM_SPREAD)    return TARGET_ITEM_SPREAD_COLOR;
else                                        return TARGET_COLOR;
}

static int16_t Get_Target_Initial_HP(TargetType type)
{
    if (type == TARGET_TYPE_ADVANCED)       return TARGET_ADVANCED_HP;
    if (type == TARGET_TYPE_BOSS)           return TARGET_BOSS_HP;
    if (type == TARGET_TYPE_ITEM_HEAL)      return TARGET_ITEM_HEAL_HP;
    if (type == TARGET_TYPE_ITEM_SPREAD)    return TARGET_ITEM_SPREAD_HP;
    else                                    return 1;
}

static uint16_t Get_Target_Kill_Score(TargetType type)
{
    if (type == TARGET_TYPE_ADVANCED)       return TARGET_SCORE_ADVANCED;
    if (type == TARGET_TYPE_BOSS)           return TARGET_SCORE_BOSS;
    else                                    return TARGET_SCORE_NORMAL;
}

static uint8_t Is_Target_Item(TargetType type)
{
    return (type == TARGET_TYPE_ITEM_HEAL || type == TARGET_TYPE_ITEM_SPREAD) ? 1 : 0;
}

static int32_t Max(int32_t a, int32_t b)
{
    return (a > b) ? a : b;
}

static int32_t Clamp(int32_t value, int32_t min_value, int32_t max_value)
{
    if (value < min_value) return min_value;
    if (value > max_value) return max_value;
    return value;
}

static uint8_t Circle_Rect_Overlap(uint16_t circle_x, uint16_t circle_y, uint16_t circle_r,
                                   uint16_t rect_center_x, uint16_t rect_center_y,
                                   uint16_t rect_w, uint16_t rect_h)
{
    int32_t half_w      = rect_w / 2;
    int32_t half_h      = rect_h / 2;
    int32_t rect_left   = (int32_t)rect_center_x - half_w;
    int32_t rect_top    = (int32_t)rect_center_y - half_h;
    int32_t rect_right  = (int32_t)rect_center_x + half_w;
    int32_t rect_bottom = (int32_t)rect_center_y + half_h;

    int32_t closest_x = Clamp((int32_t)circle_x, rect_left, rect_right);
    int32_t closest_y = Clamp((int32_t)circle_y, rect_top, rect_bottom);

    int32_t dx = (int32_t)circle_x - closest_x;
    int32_t dy = (int32_t)circle_y - closest_y;
    return ((dx * dx) + (dy * dy) <= (int32_t)(circle_r * circle_r)) ? 1 : 0;
}

static void Draw_Target_Entity(uint16_t x, uint16_t y, TargetType type, uint8_t color)
{
    if (Is_Target_Item(type))
    {
        uint16_t draw_x = (x > (TARGET_ITEM_WIDTH / 2)) ? (x - (TARGET_ITEM_WIDTH / 2)) : 0;
        uint16_t draw_y = (y > (TARGET_ITEM_HEIGHT / 2)) ? (y - (TARGET_ITEM_HEIGHT / 2)) : PLAY_AREA_Y0;
        LCD_Draw_Rect(draw_x, draw_y, TARGET_ITEM_WIDTH, TARGET_ITEM_HEIGHT, color, 1);
    }
    else
    {
        LCD_Draw_Circle(x, y, Get_Target_Radius(type), color, 1);
    }
}

// Reference: Unit 3.2 Joystick

/**
 * @brief Check if two circles overlap (for collision detection)
 * 
 * Two circles collide when the distance between their centers is less than
 * the sum of their radii. This function calculates the squared distance to
 * avoid expensive sqrt() operations - we compare squared distances instead.
 * 
 * @param x1, y1 Center coordinates of first circle
 * @param x2, y2 Center coordinates of second circle
 * @param r1, r2 Radii of the two circles
 * @return 1 if circles overlap, 0 otherwise
 */
uint8_t Circles_Overlap(uint16_t x1, uint16_t y1, uint16_t r1,
                        uint16_t x2, uint16_t y2, uint16_t r2)
{
  int32_t dx = (int32_t)x2 - (int32_t)x1;
  int32_t dy = (int32_t)y2 - (int32_t)y1;
  int32_t dist_squared = (dx * dx) + (dy * dy);
  int32_t radii_sum = r1 + r2;
  int32_t radii_sum_squared = radii_sum * radii_sum;
  
  return (dist_squared <= radii_sum_squared) ? 1 : 0;
}

/**
 * @brief Place a target at a random screen location that doesn't collide with player or other targets
 * 
 * This function uses a trial-and-error approach to find a valid spawn location:
 * 1) Generate random X/Y pixel coordinates within screen bounds
 * 2) Check if the location collides with the player using circle overlap detection
 * 3) Check if the location collides with any other targets
 * 4) If no collision, place the target and draw it on screen
 * 5) If collision detected, try again (up to 100 attempts)
 * 
 * The collision checking uses circle overlap: two circles collide if the distance
 * between their centers is less than the sum of their radii. This creates smooth,
 * natural-feeling collisions rather than harsh grid-based detection.
 * 
 * @param index Which target slot (0 to TARGET_COUNT-1) to place
 * @param target_x Array holding X pixel positions of all targets
 * @param target_y Array holding Y pixel positions of all targets
 * @param player_x Current player X position (to avoid spawning on player)
 * @param player_y Current player Y position
 */
void Place_Target(uint8_t index,
                  uint16_t *target_x,
                  uint16_t *target_y,
                  TargetType *target_type,
                  int16_t *target_hp,
                  uint32_t *target_last_fire_tick,
                  uint16_t player_x,
                  uint16_t player_y,
                  const GameDifficulty *difficulty)
{
    uint8_t tries = 0;
    TargetType picked_type = Pick_Target_Type(difficulty);
    uint8_t spawn_radius = Get_Target_Radius(picked_type);
    uint8_t spawn_color = Get_Target_Color(picked_type);
    const uint16_t min_spacing = (PLAYER_RADIUS + TARGET_BOSS_RADIUS);
    const uint16_t top_spawn_y = PLAY_AREA_Y0 + spawn_radius;

