AllogeneSSRD/STM32-Game-Engine/Menu_Template/game_1/Game_1.c
    while (tries < 100)
    {
        // Generate random position within play area, with margins for the target radius
        uint16_t x = Random_U16(LCD_WIDTH - 2 * spawn_radius) + spawn_radius;
        uint16_t y = top_spawn_y;

        // Check collision with player
        uint8_t collision = Circles_Overlap(x, y, min_spacing / 2, player_x, player_y, PLAYER_RADIUS);
        
        // Check collision with other targets
        if (!collision)
        {
            for (uint8_t i = 0; i < TARGET_COUNT; i++)
            {
                if (i == index) continue;
                if (target_y[i] != 0 &&
                    Circles_Overlap(x, y, spawn_radius, 
                                    target_x[i], target_y[i], 
                                    Get_Target_Radius(target_type[i])))
                {
                    collision = 1;
                    break;
                }
            }
        }

        if (!collision)
        {
            target_x[index] = x;
            target_y[index] = y;
            target_type[index] = picked_type;
            target_hp[index] = Get_Target_Initial_HP(picked_type);
            target_last_fire_tick[index] = HAL_GetTick();

            Draw_Target_Entity(x, y, picked_type, spawn_color);
            return;
        }

        tries++;
    }
}



MenuState Game1_Run(void) 
{
    SubMenuSystem submenu;
    SubMenuState selected_mode;
    Joystick_t joystick_data;

    SubMenu_Init(&submenu);

    // 外部循环：子菜单选择模式；游戏内BT3返回这里 
    // 内部循环：运行实际游戏，直到BT3按下返回子菜单
    // Outer loop: submenu selects mode; gameplay BT3 returns here.
    // Inner loop: runs the actual game until BT3 is pressed to return to submenu.
    while (1) {
        selected_mode = SubMenu_Run(&submenu);
        if (selected_mode == SUBMENU_1_STATE_HOME || selected_mode == SUBMENU_1_STATE_RETURN_MAIN) {
            return MENU_STATE_HOME;
        }

        GameDifficulty difficulty = Get_Difficulty_From_Mode(selected_mode);

        // Play a brief startup sound
        buzzer_tone(&buzzer_cfg, 1000, 30);  // 1kHz at 30% volume
        HAL_Delay(50);  // Brief beep duration
        buzzer_off(&buzzer_cfg);  // Stop the buzzer

        // ===== Initialize Game =====
        LCD_Fill_Buffer(0);
        
        // Initialize player at center of screen
        uint16_t player_x = LCD_WIDTH / 2;
        uint16_t player_y = LCD_HEIGHT / 2;
        uint16_t prev_player_x = player_x;
        uint16_t prev_player_y = player_y;
        uint32_t last_move_tick = HAL_GetTick();
        // Draw player
        LCD_Draw_Circle(player_x, player_y, PLAYER_RADIUS, PLAYER_COLOR, 1);

        // Initial targets
        uint16_t target_x[TARGET_COUNT] = {0};
        uint16_t target_y[TARGET_COUNT] = {0};
        TargetType target_type[TARGET_COUNT] = {TARGET_TYPE_NORMAL};
        int16_t target_hp[TARGET_COUNT] = {0};
        uint32_t target_last_fire_tick[TARGET_COUNT] = {0};
        uint32_t last_target_move_tick = HAL_GetTick();
        for (uint8_t i = 0; i < TARGET_COUNT; i++)
        {
            Place_Target(i, target_x, target_y, target_type, target_hp, target_last_fire_tick,
                         player_x, player_y, &difficulty);
        }

        // Initialize bullet
        uint16_t bullet_x[MAX_BULLETS] = {0};
        int16_t bullet_y[MAX_BULLETS] = {0};
        uint8_t bullet_active[MAX_BULLETS] = {0};
        uint32_t last_bullet_move_tick = HAL_GetTick();

        // Initialize boss bullets
        uint16_t enemy_bullet_x[MAX_ENEMY_BULLETS] = {0};
        int16_t enemy_bullet_y[MAX_ENEMY_BULLETS] = {0};
        uint8_t enemy_bullet_active[MAX_ENEMY_BULLETS] = {0};

        uint32_t spread_shot_until_ms = 0;

        // Initialize score & life
        uint16_t score = 0;
        int16_t lives = PLAYER_HP;
        char hud_str[64];
        if (difficulty.win_score > 0)
        {
            sprintf(hud_str, "%s  %2d/%3d  L:%2d", difficulty.mode_name, score, difficulty.win_score, lives);
        }
        else
        {
            sprintf(hud_str, "INF  %2d  L:%2d", score, lives);
        }
        LCD_Draw_Rect(0, 0, LCD_WIDTH, 25, 0, 1);
        LCD_printString(hud_str, HUD_OFFSET_X, HUD_OFFSET_Y, 1, 2);

        // Initialize button hold tracking for returning to submenu
        uint32_t btn3_press_start_ms = 0;   // 按下开始时间
        uint32_t btn3_hold_ms = 0;          // 已按住的时间
        char btn_hold_str[64];

        LCD_Draw_Rect(0, LCD_HEIGHT - 20, LCD_WIDTH, 20, 0, 1);
        LCD_printString("Hold BT3 to return", 10, 220, 1, 1);

        LCD_Refresh(&cfg0);

        // Game loop
        while (1) 
        {
            uint32_t frame_start = HAL_GetTick();

            // Read input
            Input_Read();

            // 按下瞬间 -> 记录起始时间
            if (current_input.btn3_pressed) btn3_press_start_ms = frame_start;
            if (btn3_press_start_ms != 0) 
            {
                if (HAL_GPIO_ReadPin(BTN3_GPIO_Port, BTN3_Pin) == GPIO_PIN_RESET)
                {
                    btn3_hold_ms = frame_start - btn3_press_start_ms;
                    sprintf(btn_hold_str,
                            "Hold BT3: %lu / %u ms",
                            btn3_hold_ms, BTN3_HOLD_MS);

                    LCD_Draw_Rect(0, LCD_HEIGHT - 20, LCD_WIDTH, 20, 0, 1);
                    LCD_printString(btn_hold_str, 10, 220, 1, 1);

                    if (btn3_hold_ms >= BTN3_HOLD_MS) 
                    {
                        // Game over
                        char score_str[64];
                        sprintf(score_str, "Score: %2d  HP: %2d", score, lives);

                        buzzer_note(&buzzer_cfg, NOTE_A4, 60);
                        LCD_Fill_Buffer(0);
                        LCD_printString("GAME Exit", 40, 120, 15, 3);
                        LCD_printString(score_str, 20, 160, 1, 2);
                        LCD_Refresh(&cfg0);
                        HAL_Delay(3500);
                        buzzer_off(&buzzer_cfg);

                        LCD_Fill_Buffer(0);
                        LCD_printString("BACK TO MENU...", 20, 120, 1, 2);
                        LCD_Refresh(&cfg0);
                        HAL_Delay(1000);
                        break;
                    }
                }
                else // 松手 -> 清零
                {
                    btn3_press_start_ms = 0;
                    btn3_hold_ms = 0;
                    LCD_Draw_Rect(0, LCD_HEIGHT - 20, LCD_WIDTH, 20, 0, 1);
                    // LCD_printString("Hold BT3 to return", 10, 220, 1, 1);
                }
            }

            // ===== STEP 1: Read Joystick Input =====
            Joystick_Read(&joystick_cfg, &joystick_data);

            // ===== STEP 2: Player Movement (Rate-Limited) =====
            // Only allow movement every MOVE_DELAY_MS milliseconds to control game speed
            if ((frame_start - last_move_tick) >= MOVE_DELAY_MS && joystick_data.direction != CENTRE)
            {
            // Calculate movement delta based on joystick direction
            // dx/dy represent pixel movement in X and Y directions
            int16_t dx = 0;
            int16_t dy = 0;

            switch (joystick_data.direction)
            {
                case N:  dy = -MOVE_SPEED; break;
                case NE: dy = -MOVE_SPEED; dx =  MOVE_SPEED; break;
                case E:  dx =  MOVE_SPEED; break;
                case SE: dy =  MOVE_SPEED; dx =  MOVE_SPEED; break;
                case S:  dy =  MOVE_SPEED; break;
                case SW: dy =  MOVE_SPEED; dx = -MOVE_SPEED; break;
                case W:  dx = -MOVE_SPEED; break;
                case NW: dy = -MOVE_SPEED; dx = -MOVE_SPEED; break;
                default: break;
            }

            // Apply movement if joystick is deflected
            if (dx != 0 || dy != 0)
            {
                int32_t new_x = (int32_t)player_x + dx;
                int32_t new_y = (int32_t)player_y + dy;

                // Clamp position to screen boundaries (prevent player from leaving the display)
                // Keep player radius away from edges so the full circle stays visible
                // 将位置限制在屏幕边界内（防止玩家离开屏幕）
                // 保持玩家半径远离边缘，以便整个圆圈始终可见
                if (new_x < PLAYER_RADIUS) new_x = PLAYER_RADIUS;
                if (new_x >= (LCD_WIDTH - PLAYER_RADIUS)) new_x = LCD_WIDTH - PLAYER_RADIUS - 1;
                if (new_y < (PLAY_AREA_Y0 + PLAYER_RADIUS)) new_y = PLAY_AREA_Y0 + PLAYER_RADIUS;
                if (new_y >= (LCD_HEIGHT - PLAYER_RADIUS)) new_y = LCD_HEIGHT - PLAYER_RADIUS - 1;

                player_x = (uint16_t)new_x;
                player_y = (uint16_t)new_y;
            }

            last_move_tick = frame_start;
            }

            // ===== STEP 3: Render Player Movement =====
            // Only redraw if player actually moved (avoids unnecessary LCD operations)
            // 仅当玩家实际移动时才重新绘制（避免不必要的 LCD 操作）
            if (player_x != prev_player_x || player_y != prev_player_y)
            {
                // Erase player at old position (draw circle in background color)
                // Draw player at new position (draw circle in player color)
                // 擦除玩家上一帧的图像（以背景色绘制圆圈）
                // 在新位置绘制玩家（用玩家颜色绘制圆圈）                
                LCD_Draw_Circle(prev_player_x, prev_player_y, PLAYER_RADIUS, 0, 1);
                LCD_Draw_Circle(player_x, player_y, PLAYER_RADIUS, PLAYER_COLOR, 1);

                prev_player_x = player_x;
                prev_player_y = player_y;
            }

