AllogeneSSRD/STM32-Game-Engine/Menu_Template/game_1/Game_1.c
            // ===== STEP 4: Bullet Create and Movement =====
            // Update - fire
            bool fired = false;
            if ((frame_start - last_bullet_move_tick) >= difficulty.bullet_fire_interval_ms)
            {
                if (spread_shot_until_ms > frame_start)
                {
                    for (int8_t spread = 0; spread < SPREAD_BULLET_COUNT; spread++)
                    {
                        for (uint8_t i = 0; i < MAX_BULLETS; i++)
                        {
                            if (!bullet_active[i])
                            {
                                int32_t bullet_spawn_x = (int32_t)player_x + ((spread - (SPREAD_BULLET_COUNT / 2)) * SPREAD_BULLET_OFFSET);
                                bullet_spawn_x = Clamp(bullet_spawn_x, BULLET_RADIUS, LCD_WIDTH - BULLET_RADIUS - 1);
                                bullet_x[i] = (uint16_t)bullet_spawn_x;
                                bullet_y[i] = (int16_t)player_y - PLAYER_RADIUS - BULLET_RADIUS;
                                bullet_active[i] = 1;
                                fired = true;
                                break;
                            }
                        }
                    }
                }
                else
                {
                    for (uint8_t i = 0; i < MAX_BULLETS; i++)
                    {
                        if (!bullet_active[i])
                        {
                            bullet_x[i] = player_x;
                            bullet_y[i] = (int16_t)player_y - PLAYER_RADIUS - BULLET_RADIUS;
                            bullet_active[i] = 1;
                            fired = true;
                            break;
                        }
                    }
                }
                if (fired) last_bullet_move_tick = frame_start;
            }

            // Update - move
            for (uint8_t i = 0; i < MAX_BULLETS; i++)
            {
                // Old position for bullet (used to erase previous frame)
                if (!bullet_active[i]) continue;
                LCD_Draw_Circle(bullet_x[i], (uint16_t)bullet_y[i], BULLET_RADIUS, 0, 1);

                // New position for bullet (move up)
                bullet_y[i] -= BULLET_SPEED;
                if (bullet_y[i] <= (PLAY_AREA_Y0 + BULLET_RADIUS)) 
                {
                    bullet_active[i] = 0;
                }
                else
                {
                    LCD_Draw_Circle(bullet_x[i], (uint16_t)bullet_y[i], BULLET_RADIUS, 3, 1);
                }
            }

            // ===== STEP 5: Target Falling Movement =====
            if ((frame_start - last_target_move_tick) >= difficulty.target_move_delay_ms)
            {
                for (uint8_t i = 0; i < TARGET_COUNT; i++)
                {
                    uint8_t radius = Get_Target_Radius(target_type[i]);
                    uint8_t color = Get_Target_Color(target_type[i]);

                    Draw_Target_Entity(target_x[i], target_y[i], target_type[i], 0);

                    uint16_t new_target_y = target_y[i] + difficulty.target_fall_speed;
                    if (new_target_y >= (LCD_HEIGHT - radius))
                    {
                        Place_Target(i, target_x, target_y, target_type, target_hp, target_last_fire_tick,
                                     player_x, player_y, &difficulty);
                        continue;
                    }

                    target_y[i] = new_target_y;
                    Draw_Target_Entity(target_x[i], target_y[i], target_type[i], color);

                    // Boss bullet spawn
                    if (target_type[i] == TARGET_TYPE_BOSS &&
                        (frame_start - target_last_fire_tick[i]) >= difficulty.boss_fire_interval_ms)
                    {
                        for (uint8_t j = 0; j < MAX_ENEMY_BULLETS; j++)
                        {
                            if (!enemy_bullet_active[j])
                            {
                                enemy_bullet_x[j] = target_x[i];
                                enemy_bullet_y[j] = (int16_t)target_y[i] + radius + ENEMY_BULLET_RADIUS;
                                enemy_bullet_active[j] = 1;
                                target_last_fire_tick[i] = frame_start;
                                break;
                            }
                        }
                    }
                }

            last_target_move_tick = frame_start;
            }

            // Boss bullet movement and collision (same hit behavior: touch player costs life)
            for (uint8_t k = 0; k < MAX_ENEMY_BULLETS; k++)
            {
                if (!enemy_bullet_active[k]) continue;

                LCD_Draw_Circle(enemy_bullet_x[k], (uint16_t)enemy_bullet_y[k], ENEMY_BULLET_RADIUS, 0, 1);
                enemy_bullet_y[k] += ENEMY_BULLET_SPEED;

                if (enemy_bullet_y[k] >= (LCD_HEIGHT - ENEMY_BULLET_RADIUS))
                {
                    enemy_bullet_active[k] = 0;
                    continue;
                }

                if (Circles_Overlap(player_x, player_y, PLAYER_RADIUS,
                                    enemy_bullet_x[k], (uint16_t)enemy_bullet_y[k], ENEMY_BULLET_RADIUS))
                {
                    enemy_bullet_active[k] = 0;
                    lives--;
                    continue;
                }

                LCD_Draw_Circle(enemy_bullet_x[k], (uint16_t)enemy_bullet_y[k], 
                            ENEMY_BULLET_RADIUS, ENEMY_BULLET_COLOR, 1);
            }

            // ===== STEP -2: Collision Detection =====
            // Circle overlap collision: check if circles touch or overlap
            // Two circles collide when distance between centers < sum of radii
            // 圆重叠碰撞检测：检查圆是否接触或重叠
            // 当两个圆心之间的距离小于半径之和时，这两个圆会发生碰撞。            
            for (uint8_t i = 0; i < TARGET_COUNT; i++)
            {
                uint8_t target_radius = Get_Target_Radius(target_type[i]);

                // Check if player circle overlaps with target
                uint8_t player_hit = 0;
                if (Is_Target_Item(target_type[i]))
                {
                    player_hit = Circle_Rect_Overlap(player_x, player_y, PLAYER_RADIUS,
                                                     target_x[i], target_y[i],
                                                     TARGET_ITEM_WIDTH, TARGET_ITEM_HEIGHT);
                }
                else
                {
                    player_hit = Circles_Overlap(player_x, player_y, PLAYER_RADIUS,
                                                 target_x[i], target_y[i], target_radius);
                }

                if (player_hit)
                {
                    // When the player collides with the enemy, Erase enemy
                    Draw_Target_Entity(target_x[i], target_y[i], target_type[i], 0);

