AllogeneSSRD/STM32-Game-Engine/Menu_Template/game_1/Game_1.c
                    if (target_type[i] == TARGET_TYPE_ITEM_HEAL)
                    {
                        if (lives < PLAYER_HP * 2) // Prevent overheal
                        {
                            lives++;
                        }
                    }
                    else if (target_type[i] == TARGET_TYPE_ITEM_SPREAD)
                    {
                        spread_shot_until_ms = frame_start + SPREAD_POWERUP_DURATION_MS;
                    }
                    else
                    {
                        score++;
                        lives--; // Decrease lives when player collides with target
                    }

                    Place_Target(i, target_x, target_y, target_type, target_hp, target_last_fire_tick,
                                 player_x, player_y, &difficulty);
                }

                // Check if any active bullets overlap with target
                if (Is_Target_Item(target_type[i])) continue;

                for (uint8_t b = 0; b < MAX_BULLETS; b++)
                {
                    if (!bullet_active[b]) continue;

                    if (Circles_Overlap(bullet_x[b], bullet_y[b], BULLET_RADIUS,
                                        target_x[i], target_y[i], target_radius))
                    {
                        // When the bullet collides with the enemy, Erase bullet
                        Draw_Target_Entity(target_x[i], target_y[i], target_type[i], 0);
                        LCD_Draw_Circle(bullet_x[b], (uint16_t)bullet_y[b], BULLET_RADIUS, 0, 1);
                        bullet_active[b] = 0;

                        target_hp[i]--;

                        if (target_hp[i] <= 0)
                        {
                            score += Get_Target_Kill_Score(target_type[i]);
                            Place_Target(i, target_x, target_y, target_type, target_hp, target_last_fire_tick,
                                         player_x, player_y, &difficulty);
                        }
                        else
                        {
                            Draw_Target_Entity(target_x[i], target_y[i], target_type[i], Get_Target_Color(target_type[i]));
                        }

                        break;
                    }
                }
            }
            
            if (difficulty.win_score > 0)
            {
                sprintf(hud_str, "%s  %2d/%3d  L:%2d", difficulty.mode_name, score, difficulty.win_score, lives);
            }
            else
            {
                sprintf(hud_str, "INF  %2d  L:%2d", score, lives);
            }
            LCD_Draw_Rect(0, 0, LCD_WIDTH, 25, 0, 1);
            LCD_printString(hud_str, HUD_OFFSET_X, HUD_OFFSET_Y, 1, 2);


            // ===== STEP -1: Update Display =====
            // Transfer the frame buffer to the LCD hardware (makes all draws visible)
            LCD_Refresh(&cfg0);

            // // UPDATE: Game logic
            // animation_counter++;

            // // Simple animation: move object back and forth
            // moving_x += move_direction * move_step;
            // if (moving_x >= 200 || moving_x <= 0) {
            //     move_direction *= -1;
            // }

            // Example: Vary LED brightness based on animation
            // uint8_t brightness = (moving_x * 100) / 200;
            // PWM_SetDuty(&pwm_cfg, brightness);

            // // RENDER: Draw to LCD
            // LCD_Fill_Buffer(0);

            // // Title
            // LCD_printString("GAME 1", 60, 10, 1, 3);
            // LCD_printString((char*)mode_options[selected_mode - SUBMENU_1_STATE_1], 60, 45, 1, 2);

            // // Simple animated object (moving box)
            // LCD_printString("[*]", 20 + moving_x, 100, 1, 3);

            // // Display counter
            // char counter[32];
            // sprintf(counter, "Frame: %lu", animation_counter);
            // LCD_printString(counter, 50, 150, 1, 2);

            // // Show PWM LED usage
            // LCD_printString("LED: PWM Demo", 30, 180, 1, 1);
            // char pwm_str[32];
            // sprintf(pwm_str, "Brightness: %d%%", brightness);
            // LCD_printString(pwm_str, 30, 195, 1, 1);

            // // Instructions
            // LCD_printString("Press BT3 to", 40, 210, 1, 1);
            // LCD_printString("Back to Mode Menu", 20, 225, 1, 1);

            // LCD_Refresh(&cfg0);

            // Frame timing - wait for remainder of frame time
            uint32_t frame_time = HAL_GetTick() - frame_start;
            if (frame_time < GAME1_FRAME_TIME_MS) {
                HAL_Delay(GAME1_FRAME_TIME_MS - frame_time);
            }
            // Exit game loop when player has no lives left
            if (lives <= 0)
            {   
                // Game over
                char score_str[64];
                sprintf(score_str, "Score: %2d  HP: %2d", score, lives);

                buzzer_note(&buzzer_cfg, NOTE_A4, 60);
                LCD_Fill_Buffer(0);
                LCD_printString("GAME OVER", 40, 120, 15, 3);
                LCD_printString(score_str, 20, 160, 1, 2);
                LCD_Refresh(&cfg0);
                HAL_Delay(3000);
                buzzer_off(&buzzer_cfg);

                LCD_Fill_Buffer(0);
                LCD_printString("BACK TO MENU...", 20, 120, 1, 2);
                LCD_Refresh(&cfg0);
                HAL_Delay(1000);
                break;
            }

            // For easy/hard mode: exit loop when reaching target score
            if (difficulty.win_score > 0 && score >= difficulty.win_score)
            {
                buzzer_tone(&buzzer_cfg, 1500, 35);
                LCD_Fill_Buffer(0);
                LCD_printString("YOU WIN", 60, 110, 2, 3);
                LCD_printString((char*)difficulty.mode_name, 70, 145, 1, 2);
                LCD_Refresh(&cfg0);
                HAL_Delay(3000);
                buzzer_off(&buzzer_cfg);

                LCD_Fill_Buffer(0);
                LCD_printString("BACK TO MENU...", 20, 120, 1, 2);
                LCD_Refresh(&cfg0);
                HAL_Delay(1000);
                break;
            }
        }
    }
}
